// 系列的参数字典
// TODO: 使用 json 读取
var sparamDic = {
    "mark":["散点标记",{
        "*":"圆点",
        "o":"圆圈",
    }],
    "only marks":["只显示散点标记"],
    "scatter":["七彩散点标记"],
    "ybar":["纵向柱形图"],
    "xbar":["横向柱形图"],
    "domain":["自变量定义域",{
        "[起始]:[终止]":"自变量的起始与终止点",
    }],
    "samples":["取样数量",{
        "样本点的取样数量":"",
    }],
    "color":["线形颜色",{
        "线形颜色":"",
    }],
    "fill":["填充颜色",{
        "填充颜色":"",
    }]
};

// 三维参数增补字典
var etdparamDic = {
    "mesh":["曲面线框"],
    "surf":["曲面填充层"],
    "contour filled":["等高填充图"],
    "contour gnuplot":["等高线图"],
};